//
//  ImGuiColor.h
//  TubePro
//
//  Created by Laote on 2023/12/15.
//

#ifndef ImGuiColor_h
#define ImGuiColor_h

#include <stdio.h>
#include "imgui.h"

#pragma mark - 颜色工具

ImColor 图片颜色(1.0f, 1.0f, 1.0f, 0.7f);


ImColor Im鲜艳红(1.0f, 0.0f, 0.0f, 1.0f);          // 鲜艳红
ImColor Im橙黄色(1.0f, 0.647f, 0.0f, 1.0f);        // 橙黄色
ImColor Im青柠绿(0.502f, 1.0f, 0.0f, 1.0f);        // 青柠绿
ImColor Im天蓝色(0.0f, 0.749f, 1.0f, 1.0f);        // 天蓝色
ImColor Im宝蓝色(0.0f, 0.0f, 1.0f, 1.0f);          // 宝蓝色
ImColor Im紫色(0.502f, 0.0f, 0.502f, 1.0f);        // 紫色
ImColor Im半紫色(0.502f, 0.0f, 0.502f, 0.7f);        // 紫色
ImColor Im黑色(0.0f, 0.0f, 0.0f, 1.0f);            // 黑色
ImColor Im白色(1.0f, 1.0f, 1.0f, 1.0f);            // 白色
ImColor Im灰色(0.502f, 0.502f, 0.502f, 1.0f);      // 灰色
ImColor ImBackColor(0.012f, 0.059f, 0.114f, 0.7f);
ImColor UpAndDownColor(0.012f, 0.059f, 0.114f, 1.0f);

ImColor Im绿色(0.0f, 1.0f, 0.0f, 1.0f);
ImColor Im栗色(0.396f, 0.263f, 0.129f, 1.0f);      // 栗色
ImColor Im褐色(0.647f, 0.165f, 0.165f, 1.0f);      // 褐色
ImColor Im橙色(1.0f, 0.549f, 0.0f, 1.0f);          // 橙色
ImColor Im黄色(1.0f, 1.0f, 0.0f, 1.0f);            // 黄色
ImColor Im橄榄绿(0.502f, 0.502f, 0.0f, 1.0f);      // 橄榄绿
ImColor Im森林绿(0.133f, 0.545f, 0.133f, 1.0f);    // 森林绿
ImColor Im青色(0.0f, 1.0f, 1.0f, 1.0f);            // 青色
ImColor Im钢蓝色(0.275f, 0.510f, 0.706f, 1.0f);    // 钢蓝色
ImColor Im深蓝色(0.0f, 0.0f, 0.545f, 1.0f);        // 深蓝色
ImColor Im海军蓝(0.0f, 0.0f, 0.502f, 1.0f);        // 海军蓝
ImColor 浅蓝色(0.0f, 0.0f, 0.7f, 1.0f);            // 浅蓝色
ImColor 玻璃磨砂颜色(1.0f, 1.0f, 1.0f, 0.2f);

ImColor Im粉红色(1.0f, 0.753f, 0.796f, 1.0f);      // 粉红色
ImColor Im桃红(1.0f, 0.714f, 0.757f, 1.0f);        // 桃红
ImColor Im雪白(1.0f, 0.980f, 0.980f, 1.0f);        // 雪白
ImColor Im杏仁白(0.937f, 0.871f, 0.804f, 1.0f);    // 杏仁白
ImColor Im珊瑚红(1.0f, 0.498f, 0.314f, 1.0f);      // 珊瑚红
ImColor Im番茄红(1.0f, 0.388f, 0.278f, 1.0f);      // 番茄红
ImColor Im巧克力色(0.824f, 0.412f, 0.118f, 1.0f);   // 巧克力色
ImColor Im巧克力橙(0.855f, 0.647f, 0.125f, 1.0f);   // 巧克力橙
ImColor Im金色(1.0f, 0.843f, 0.0f, 1.0f);          // 金色
ImColor Im银色(0.753f, 0.753f, 0.753f, 1.0f);      // 银色
ImColor Im红色(1.0f, 0.0f, 0.0f, 1.0f); 

ImU32 黄橙色 = IM_COL32(255, 165, 0, 255);      // 黄橙色
ImU32 红粉色 = IM_COL32(255, 192, 203, 255);    // 红粉色
ImU32 绿青色 = IM_COL32(0, 255, 255, 255);      // 绿青色
ImU32 黑色 = IM_COL32(0, 0, 0, 255);            // 黑色
ImU32 白色 = IM_COL32(255, 255, 255, 255);      // 白色
ImU32 灰色 = IM_COL32((int)(0.60f * 255), (int)(0.60f * 255), (int)(0.60f * 255), (int)(0.70f * 255));
// ImU32 灰色 = IM_COL32(128, 128, 128, 255);      // 灰色
ImU32 青色 = IM_COL32(0, 128, 128, 255);        // 青色
ImU32 金色 = IM_COL32(255, 215, 0, 255);        // 金色
ImU32 巧克力色 = IM_COL32(210, 105, 30, 255);    // 巧克力色
ImU32 天蓝色 = IM_COL32(135, 206, 250, 255);    // 天蓝色
ImU32 薰衣草紫 = IM_COL32(230, 230, 250, 255);  // 薰衣草紫
ImU32 暗红绿色 = IM_COL32(128, 64, 64, 255);   // 暗红绿色
ImU32 银灰色 = IM_COL32(192, 192, 192, 255);    // 银灰色
ImU32 暗黄蓝色 = IM_COL32(64, 128, 192, 255);   // 暗黄蓝色
ImU32 暗橙蓝色 = IM_COL32(128, 128, 192, 255);  // 暗橙蓝色
ImU32 浅绿蓝色 = IM_COL32(192, 255, 255, 255);  // 浅绿蓝色
ImU32 浅橙蓝色 = IM_COL32(255, 192, 255, 255);  // 浅橙蓝色
ImU32 紫红色 = IM_COL32(255, 0, 255, 255);      // 紫红色
ImU32 天青色 = IM_COL32(0, 255, 255, 255);      // 天青色
ImU32 亮橙黄 = IM_COL32(255, 255, 128, 255);    // 亮橙黄
ImU32 亮粉红 = IM_COL32(255, 128, 128, 255);    // 亮粉红
ImU32 橙红色 = IM_COL32(255, 64, 0, 255);       // 橙红色
ImU32 红紫色 = IM_COL32(255, 0, 128, 255);      // 红紫色
ImU32 青绿色 = IM_COL32(0, 128, 255, 255);      // 青绿色
ImU32 黄绿色 = IM_COL32(128, 255, 0, 255);      // 黄绿色
ImU32 绿蓝色 = IM_COL32(0, 255, 128, 255);      // 绿蓝色
ImU32 深蓝绿色 = IM_COL32(0, 64, 128, 255);     // 深蓝绿色
ImU32 深紫蓝色 = IM_COL32(64, 0, 128, 255);     // 深紫蓝色
ImU32 海蓝色 = IM_COL32(0, 128, 192, 255);      // 海蓝色
ImU32 草绿色 = IM_COL32(128, 192, 0, 255);      // 草绿色
ImU32 亮紫色 = IM_COL32(192, 0, 255, 255);      // 亮紫色
ImU32 亮蓝绿色 = IM_COL32(0, 192, 255, 255);    // 亮蓝绿色
ImU32 青紫色 = IM_COL32(128, 0, 192, 255);      // 青紫色
ImU32 暗橙红 = IM_COL32(192, 64, 0, 255);       // 暗橙红
ImU32 暗黄绿色 = IM_COL32(64, 192, 0, 255);     // 暗黄绿色
ImU32 暗青蓝色 = IM_COL32(0, 64, 192, 255);     // 暗青蓝色
ImU32 亮橙黄色 = IM_COL32(255, 192, 128, 255);  // 亮橙黄色
ImU32 橙黄色 = IM_COL32(255, 128, 64, 255);     // 橙黄色
ImU32 亮黄绿色 = IM_COL32(192, 255, 128, 255);  // 亮黄绿色
ImU32 黄蓝色 = IM_COL32(128, 192, 255, 255);     // 黄蓝色
ImU32 浅橙红 = IM_COL32(255, 192, 192, 255);     // 浅橙红
ImU32 浅橙黄色 = IM_COL32(255, 255, 192, 255);  // 浅橙黄色
ImU32 浅橙绿色 = IM_COL32(192, 255, 192, 255);  // 浅橙绿色
ImU32 浅黄蓝色 = IM_COL32(192, 192, 255, 255);  // 浅黄蓝色
ImU32 暗橙黄色 = IM_COL32(128, 64, 0, 255);     // 暗橙黄色
ImU32 暗绿蓝色 = IM_COL32(64, 192, 128, 255);   // 暗绿蓝色
ImU32 海蓝绿色 = IM_COL32(0, 192, 128, 255);    // 海蓝绿色
ImU32 暗橙绿色 = IM_COL32(128, 64, 128, 255);   // 暗橙绿色
ImU32 亮青蓝色 = IM_COL32(128, 255, 192, 255);  // 亮青蓝色
ImU32 浅青蓝色 = IM_COL32(192, 255, 255, 255);  // 浅青蓝色

#endif /* ImGuiColor_h */
